Revit 2027 API
BeamSystem.Create Method
Overload List
Name | Description
Create(Document, IList<Curve>, SketchPlane, Int32) |  Creates a 2D BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, Level, Int32, Boolean) |  Creates a new BeamSystem with specified profile curves.
Create(Document, IList<Curve>, SketchPlane, XYZ, Boolean) |  Creates a new BeamSystem with specified profile curves.
Top
See Also
Reference
BeamSystem Class
Autodesk.Revit.DB Namespace